In [1]:
import pymysql
import sqlalchemy
%load_ext sql
%sql mysql://root@localhost/tysql
db = pymysql.connect(host='localhost',user='root',db='tysql')
print(db)

<pymysql.connections.Connection object at 0x756c9fdc90>

In [2]:
cursor=db.cursor()

In [3]:
sql002="""
select cust_name from Customers order by cust_name desc;
"""

In [4]:
cursor.execute(sql002)
result001=cursor.fetchall()

In [5]:
print(result001)

(('Village Toys',), ('The Toy Store',), ('Kids Place',), ('Fun4All',), ('Fun4All',))

In [6]:
%%sql
select vend_id from Products;

 * mysql://root@localhost/tysql
9 rows affected.

[('BRS01',),
 ('BRS01',),
 ('BRS01',),
 ('DLL01',),
 ('DLL01',),
 ('DLL01',),
 ('DLL01',),
 ('FNG01',),
 ('FNG01',)]

In [7]:
%%sql
select cust_name from Customers order by cust_name desc;

 * mysql://root@localhost/tysql
5 rows affected.

[('Village Toys',),
 ('The Toy Store',),
 ('Kids Place',),
 ('Fun4All',),
 ('Fun4All',)]

In [8]:
%%sql
select distinct cust_name from Customers order by cust_name desc;

 * mysql://root@localhost/tysql
4 rows affected.

[('Village Toys',), ('The Toy Store',), ('Kids Place',), ('Fun4All',)]

In [9]:
%%sql
show columns from Orders;

 * mysql://root@localhost/tysql
3 rows affected.

[('order_num', 'int(11)', 'NO', 'PRI', None, ''),
 ('order_date', 'datetime', 'NO', '', None, ''),
 ('cust_id', 'char(10)', 'NO', 'MUL', None, '')]

In [10]:
%%sql
select cust_id,order_num from Orders order by cust_id desc,order_date;

 * mysql://root@localhost/tysql
5 rows affected.

[('1000000005', 20008),
 ('1000000004', 20007),
 ('1000000003', 20006),
 ('1000000001', 20009),
 ('1000000001', 20005)]

In [11]:
%%sql
select distinct order_num from OrderItems where quantity>=100 order by quantity desc,item_price desc;

 * mysql://root@localhost/tysql
3 rows affected.

[(20009,), (20005,), (20007,)]

In [12]:
%%sql
select vend_name from Vendors where vend_state="CA" and vend_country="USA";

 * mysql://root@localhost/tysql
1 rows affected.

[('Doll House Inc.',)]

In [13]:
%%sql
show columns from OrderItems;

 * mysql://root@localhost/tysql
5 rows affected.

[('order_num', 'int(11)', 'NO', 'PRI', None, ''),
 ('order_item', 'int(11)', 'NO', 'PRI', None, ''),
 ('prod_id', 'char(10)', 'NO', 'MUL', None, ''),
 ('quantity', 'int(11)', 'NO', '', None, ''),
 ('item_price', 'decimal(8,2)', 'NO', '', None, '')]

In [14]:
%%sql
select * from OrderItems limit 1;

 * mysql://root@localhost/tysql
1 rows affected.

[(20005, 1, 'BR01', 100, Decimal('5.49'))]

In [15]:
%%sql
select order_num,prod_id,quantity from OrderItems where prod_id in ('BR01','BR02','BR03') and quantity >=100;

 * mysql://root@localhost/tysql
2 rows affected.

[(20005, 'BR01', 100), (20005, 'BR03', 100)]

In [16]:
%%sql
select prod_name,prod_price from Products where prod_price>=3 and prod_price<=6 order by prod_price;

 * mysql://root@localhost/tysql
5 rows affected.

[('Fish bean bag toy', Decimal('3.49')),
 ('Bird bean bag toy', Decimal('3.49')),
 ('Rabbit bean bag toy', Decimal('3.49')),
 ('Raggedy Ann', Decimal('4.99')),
 ('8 inch teddy bear', Decimal('5.99'))]

In [17]:
%%sql
select prod_name,prod_desc from Products where prod_desc like "%toy%carrots%" or prod_desc like "%carrots%toy%";

 * mysql://root@localhost/tysql
1 rows affected.

[('Rabbit bean bag toy', 'Rabbit bean bag toy, comes with bean bag carrots')]

In [18]:
%%sql
select prod_name,prod_desc from Products where prod_desc like "%toy%carrots%";

 * mysql://root@localhost/tysql
1 rows affected.

[('Rabbit bean bag toy', 'Rabbit bean bag toy, comes with bean bag carrots')]

In [19]:
%%sql
select vend_id,vend_name as vname,vend_address as vaddress,vend_city as vcity from Vendors order by vname;

 * mysql://root@localhost/tysql
6 rows affected.

[('BRE02', 'Bear Emporium', '500 Park Street', 'Anytown'),
 ('BRS01', 'Bears R Us', '123 Main Street', 'Bear Town'),
 ('DLL01', 'Doll House Inc.', '555 High Street', 'Dollsville'),
 ('FNG01', 'Fun and Games', '42 Galaxy Road', 'London'),
 ('FRB01', 'Furball Inc.', '1000 5th Avenue', 'New York'),
 ('JTS01', 'Jouets et ours', '1 Rue Amusement', 'Paris')]

In [20]:
%%sql
SELECT vend_name, UPPER(vend_name)
    FROM Vendors
    ORDER BY vend_name;

 * mysql://root@localhost/tysql
6 rows affected.

[('Bear Emporium', 'BEAR EMPORIUM'),
 ('Bears R Us', 'BEARS R US'),
 ('Doll House Inc.', 'DOLL HOUSE INC.'),
 ('Fun and Games', 'FUN AND GAMES'),
 ('Furball Inc.', 'FURBALL INC.'),
 ('Jouets et ours', 'JOUETS ET OURS')]

In [21]:
%%sql
select prod_id,prod_price,prod_price*0.9 as sale_price from Products;

 * mysql://root@localhost/tysql
9 rows affected.

[('BNBG01', Decimal('3.49'), Decimal('3.141')),
 ('BNBG02', Decimal('3.49'), Decimal('3.141')),
 ('BNBG03', Decimal('3.49'), Decimal('3.141')),
 ('BR01', Decimal('5.99'), Decimal('5.391')),
 ('BR02', Decimal('8.99'), Decimal('8.091')),
 ('BR03', Decimal('11.99'), Decimal('10.791')),
 ('RGAN01', Decimal('4.99'), Decimal('4.491')),
 ('RYL01', Decimal('9.49'), Decimal('8.541')),
 ('RYL02', Decimal('9.49'), Decimal('8.541'))]

In [22]:
%%sql
select cust_id,cust_name,concat(left(cust_contact,2),left(cust_city,3)) as user_login from Customers;

 * mysql://root@localhost/tysql
5 rows affected.

[('1000000001', 'Village Toys', 'JoDet'),
 ('1000000002', 'Kids Place', 'MiCol'),
 ('1000000003', 'Fun4All', 'JiMun'),
 ('1000000004', 'Fun4All', 'DePho'),
 ('1000000005', 'The Toy Store', 'KiChi')]

In [23]:
%%sql
show tables;

 * mysql://root@localhost/tysql
5 rows affected.

[('Customers',), ('OrderItems',), ('Orders',), ('Products',), ('Vendors',)]

In [24]:
%%sql
select order_num,order_date 
from Orders 
where year(order_date)=2020 and month(order_date)=1 
order by order_date;

 * mysql://root@localhost/tysql
2 rows affected.

[(20006, datetime.datetime(2020, 1, 12, 0, 0)),
 (20007, datetime.datetime(2020, 1, 30, 0, 0))]

In [25]:
%%sql
select * from Orders;

 * mysql://root@localhost/tysql
5 rows affected.

[(20005, datetime.datetime(2020, 5, 1, 0, 0), '1000000001'),
 (20006, datetime.datetime(2020, 1, 12, 0, 0), '1000000003'),
 (20007, datetime.datetime(2020, 1, 30, 0, 0), '1000000004'),
 (20008, datetime.datetime(2020, 2, 3, 0, 0), '1000000005'),
 (20009, datetime.datetime(2020, 2, 8, 0, 0), '1000000001')]

In [26]:
%%sql
select count(*) as ordersum001
from Orders
where cust_id = 1000000001;

 * mysql://root@localhost/tysql
1 rows affected.

[(2,)]

In [27]:
%%sql
select sum(quantity) as sumofqua
from OrderItems
where prod_id ='BR01';

 * mysql://root@localhost/tysql
1 rows affected.

[(Decimal('120'),)]

In [28]:
%%sql
select max(prod_price)
from Products
where prod_price>=10;

 * mysql://root@localhost/tysql
1 rows affected.

[(Decimal('11.99'),)]

In [29]:
%%sql
select order_num,count(*) as order_lines
from OrderItems
group by order_num
order by order_lines

 * mysql://root@localhost/tysql
5 rows affected.

[(20005, 2), (20006, 3), (20009, 3), (20007, 5), (20008, 5)]

In [30]:
%%sql
select vend_id,prod_id,min(prod_price) as cheapest_item
from Products
group by vend_id
order by cheapest_item;

 * mysql://root@localhost/tysql
3 rows affected.

[('DLL01', 'BNBG01', Decimal('3.49')),
 ('BRS01', 'BR01', Decimal('5.99')),
 ('FNG01', 'RYL01', Decimal('9.49'))]

In [31]:
%%sql
select order_num,sum(quantity) as sum_order
from OrderItems
group by order_num
having sum_order>=100;

 * mysql://root@localhost/tysql
3 rows affected.

[(20005, Decimal('200')), (20007, Decimal('400')), (20009, Decimal('750'))]

In [32]:
%%sql
select order_num,max(item_price) as max_price
from OrderItems
group by order_num
having max_price >=10
order by order_num;

 * mysql://root@localhost/tysql
4 rows affected.

[(20005, Decimal('10.99')),
 (20006, Decimal('11.99')),
 (20007, Decimal('11.49')),
 (20008, Decimal('11.99'))]

In [33]:
%%sql
select cust_id,cust_name 
from Customers
where cust_id in (select cust_id
                  from Orders
     where order_num in(select order_num
                  from OrderItems
 group by order_num
 having max(item_price)>=11))

 * mysql://root@localhost/tysql
3 rows affected.

[('1000000003', 'Fun4All'),
 ('1000000004', 'Fun4All'),
 ('1000000005', 'The Toy Store')]

In [34]:
%%sql
select * from OrderItems;

 * mysql://root@localhost/tysql
18 rows affected.

[(20005, 1, 'BR01', 100, Decimal('5.49')),
 (20005, 2, 'BR03', 100, Decimal('10.99')),
 (20006, 1, 'BR01', 20, Decimal('5.99')),
 (20006, 2, 'BR02', 10, Decimal('8.99')),
 (20006, 3, 'BR03', 10, Decimal('11.99')),
 (20007, 1, 'BR03', 50, Decimal('11.49')),
 (20007, 2, 'BNBG01', 100, Decimal('2.99')),
 (20007, 3, 'BNBG02', 100, Decimal('2.99')),
 (20007, 4, 'BNBG03', 100, Decimal('2.99')),
 (20007, 5, 'RGAN01', 50, Decimal('4.49')),
 (20008, 1, 'RGAN01', 5, Decimal('4.99')),
 (20008, 2, 'BR03', 5, Decimal('11.99')),
 (20008, 3, 'BNBG01', 10, Decimal('3.49')),
 (20008, 4, 'BNBG02', 10, Decimal('3.49')),
 (20008, 5, 'BNBG03', 10, Decimal('3.49')),
 (20009, 1, 'BNBG01', 250, Decimal('2.49')),
 (20009, 2, 'BNBG02', 250, Decimal('2.49')),
 (20009, 3, 'BNBG03', 250, Decimal('2.49'))]

In [35]:
%%sql
select * from Orders;

 * mysql://root@localhost/tysql
5 rows affected.

[(20005, datetime.datetime(2020, 5, 1, 0, 0), '1000000001'),
 (20006, datetime.datetime(2020, 1, 12, 0, 0), '1000000003'),
 (20007, datetime.datetime(2020, 1, 30, 0, 0), '1000000004'),
 (20008, datetime.datetime(2020, 2, 3, 0, 0), '1000000005'),
 (20009, datetime.datetime(2020, 2, 8, 0, 0), '1000000001')]

In [36]:
%%sql
select * from Customers;

 * mysql://root@localhost/tysql
5 rows affected.

[('1000000001', 'Village Toys', '200 Maple Lane', 'Detroit', 'MI', '44444', 'USA', 'John Smith', 'sales@villagetoys.com'),
 ('1000000002', 'Kids Place', '333 South Lake Drive', 'Columbus', 'OH', '43333', 'USA', 'Michelle Green', None),
 ('1000000003', 'Fun4All', '1 Sunny Place', 'Muncie', 'IN', '42222', 'USA', 'Jim Jones', 'jjones@fun4all.com'),
 ('1000000004', 'Fun4All', '829 Riverside Drive', 'Phoenix', 'AZ', '88888', 'USA', 'Denise L. Stephens', 'dstephens@fun4all.com'),
 ('1000000005', 'The Toy Store', '4545 53rd Street', 'Chicago', 'IL', '54545', 'USA', 'Kim Howard', None)]

In [37]:
%run?

Docstring:
Run the named file inside IPython as a program.

Usage::

  %run [-n -i -e -G]
       [( -t [-N<N>] | -d [-b<N>] | -p [profile options] )]
       ( -m mod | filename ) [args]

The filename argument should be either a pure Python script (with
extension ``.py``), or a file with custom IPython syntax (such as
magics). If the latter, the file can be either a script with ``.ipy``
extension, or a Jupyter notebook with ``.ipynb`` extension. When running
a Jupyter notebook, the output from print statements and other
displayed objects will appear in the terminal (even matplotlib figures
will open, if a terminal-compliant backend is being used). Note that,
at the system command line, the ``jupyter run`` command offers similar
functionality for executing notebooks (albeit currently with some
differences in supported options).

Parameters after the filename are passed as command-line arguments to
the program (put in sys.argv). Then, control returns to IPython's
prompt.

This is similar to running at a system prompt ``python file args``,
but with the advantage of giving you IPython's tracebacks, and of
loading all variables into your interactive namespace for further use
(unless -p is used, see below).

The file is executed in a namespace initially consisting only of
``__name__=='__main__'`` and sys.argv constructed as indicated. It thus
sees its environment as if it were being run as a stand-alone program
(except for sharing global objects such as previously imported
modules). But after execution, the IPython interactive namespace gets
updated with all variables defined in the program (except for __name__
and sys.argv). This allows for very convenient loading of code for
interactive work, while giving each program a 'clean sheet' to run in.

Arguments are expanded using shell-like glob match.  Patterns
'*', '?', '[seq]' and '[!seq]' can be used.  Additionally,
tilde '~' will be expanded into user's home directory.  Unlike
real shells, quotation does not suppress expansions.  Use
*two* back slashes (e.g. ``\\*``) to suppress expansions.
To completely disable these expansions, you can use -G flag.

On Windows systems, the use of single quotes `'` when specifying
a file is not supported. Use double quotes `"`.

Options:

-n
  __name__ is NOT set to '__main__', but to the running file's name
  without extension (as python does under import).  This allows running
  scripts and reloading the definitions in them without calling code
  protected by an ``if __name__ == "__main__"`` clause.

-i
  run the file in IPython's namespace instead of an empty one. This
  is useful if you are experimenting with code written in a text editor
  which depends on variables defined interactively.

-e
  ignore sys.exit() calls or SystemExit exceptions in the script
  being run.  This is particularly useful if IPython is being used to
  run unittests, which always exit with a sys.exit() call.  In such
  cases you are interested in the output of the test results, not in
  seeing a traceback of the unittest module.

-t
  print timing information at the end of the run.  IPython will give
  you an estimated CPU time consumption for your script, which under
  Unix uses the resource module to avoid the wraparound problems of
  time.clock().  Under Unix, an estimate of time spent on system tasks
  is also given (for Windows platforms this is reported as 0.0).

If -t is given, an additional ``-N<N>`` option can be given, where <N>
must be an integer indicating how many times you want the script to
run.  The final timing report will include total and per run results.

For example (testing the script uniq_stable.py)::

    In [1]: run -t uniq_stable

    IPython CPU timings (estimated):
      User  :    0.19597 s.
      System:        0.0 s.

    In [2]: run -t -N5 uniq_stable

    IPython CPU timings (estimated):
    Total runs performed: 5
      Times :      Total       Per run
      User  :   0.910862 s,  0.1821724 s.
      System:        0.0 s,        0.0 s.

-d
  run your program under the control of pdb, the Python debugger.
  This allows you to execute your program step by step, watch variables,
  etc.  Internally, what IPython does is similar to calling::

      pdb.run('execfile("YOURFILENAME")')

  with a breakpoint set on line 1 of your file.  You can change the line
  number for this automatic breakpoint to be <N> by using the -bN option
  (where N must be an integer). For example::

      %run -d -b40 myscript

  will set the first breakpoint at line 40 in myscript.py.  Note that
  the first breakpoint must be set on a line which actually does
  something (not a comment or docstring) for it to stop execution.

  Or you can specify a breakpoint in a different file::

      %run -d -b myotherfile.py:20 myscript

  When the pdb debugger starts, you will see a (Pdb) prompt.  You must
  first enter 'c' (without quotes) to start execution up to the first
  breakpoint.

  Entering 'help' gives information about the use of the debugger.  You
  can easily see pdb's full documentation with "import pdb;pdb.help()"
  at a prompt.

-p
  run program under the control of the Python profiler module (which
  prints a detailed report of execution times, function calls, etc).

  You can pass other options after -p which affect the behavior of the
  profiler itself. See the docs for %prun for details.

  In this mode, the program's variables do NOT propagate back to the
  IPython interactive namespace (because they remain in the namespace
  where the profiler executes them).

  Internally this triggers a call to %prun, see its documentation for
  details on the options available specifically for profiling.

There is one special usage for which the text above doesn't apply:
if the filename ends with .ipy[nb], the file is run as ipython script,
just as if the commands were written on IPython prompt.

-m
  specify module name to load instead of script path. Similar to
  the -m option for the python interpreter. Use this option last if you
  want to combine with other %run options. Unlike the python interpreter
  only source modules are allowed no .pyc or .pyo files.
  For example::

      %run -m example

  will run the example module.

-G
  disable shell-like glob expansion of arguments.
File:      /data/data/com.termux/files/usr/lib/python3.11/site-packages/IPython/core/magics/execution.py

In [38]:
%run
ls

Exception: you must provide at least a filename.

In [42]:
!ls

Untitled.ipynb  mysql-python.ipynb  sql.ipynb  untitled.py

In [40]:
!pwd

/data/data/com.termux/files/home/python

In [41]:
!cd ..

In [43]:
!ls

Untitled.ipynb  mysql-python.ipynb  sql.ipynb  untitled.py

In [44]:
!cd ..

In [45]:
!ls

Untitled.ipynb  mysql-python.ipynb  sql.ipynb  untitled.py

In [46]:
cd

/data/data/com.termux/files/home

In [47]:
ls

a.txt        downloads@  pkglist.txt  storage/
aptlist.txt  nohup.out   python/      untitled.md

In [48]:
cd python

/data/data/com.termux/files/home/python

In [49]:
ls

Untitled.ipynb  mysql-python.ipynb  sql.ipynb  untitled.py